# CLI tools layer
# Install: brew bundle --file=brewfiles/Brewfile.cli_tools

brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "dust"
brew "sd"
brew "procs"
brew "lazygit"
brew "zoxide"
brew "ranger"
brew "tmux"
brew "starship"
brew "libpq"
brew "zsh-vi-mode"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Terminal emulator
cask "ghostty"
