# CLI tools layer
# Install: brew bundle --file=brewfiles/Brewfile.cli_tools

brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "dust"
brew "sd"
brew "procs"
brew "lazygit"
brew "zoxide"
brew "ranger"
brew "nvm"
brew "bun"
brew "pnpm"
brew "tmux"
brew "libpq"
